package Lines;

import java.awt.Color;

import javax.swing.SwingUtilities;

import Frame.subwayBase;
import InSubway.SubwayManager;

//---------------------------------------------------------
//[7호선] subwayApp7.java
//---------------------------------------------------------
public class subwayApp7 extends subwayBase {

	public static String[] allStationsInLine7 = { "장암역", "도봉산역", "수락산역", "마들역", "노원역", "중계역", "하계역", "공릉역", "태릉입구역",
			"먹골역", "중화역", "상봉역", "면목역", "사가정역", "용마산역", "중곡역", "군자역", "어린이대공원역", "건대입구역", "뚝섬유원지역", "청담역", "강남구청역",
			"학동역", "논현역", "반포역", "고속터미널역", "내방역", "이수역", "남성역", "숭실대입구역", "상도역", "장승배기역", "신대방삼거리역", "보라매역", "신풍역",
			"대림역", "남구로역", "가산디지털단지역", "철산역", "광명사거리역", "천왕역", "온수역",

			// 인천 연장 구간
			"까치울역", "부천종합운동장역", "춘의역", "신중동역", "부천시청역", "상동역", "삼산체육관역", "굴포천역", "부평구청역", "산곡역", "석남역" };

	public subwayApp7() {
		super("7호선", allStationsInLine7, new Color(116, 127, 0)); // 7호선 카키색
		add(Share.BottomMenu.addFooterBar(this));
		initSubwayGraph();
		setVisible(true);
	}

	private void initSubwayGraph() {
		SubwayManager.registerSection("개화역", "김포공항역", "공항시장역", "신방화역", "마곡나루역", "양천향교역", "가양역", "증미역", "등촌역", "염창역",
				"신목동역", "선유도역", "당산역", "국회의사당역", "여의도역", "샛강역", "노량진역", "노들역", "흑석역", "동작역", "구반포역", "신반포역", "고속터미널역",
				"사평역", "신논현역", "언주역", "선정릉역", "삼성중앙역", "봉은사역", "종합운동장역", "삼전역", "석촌고분역", "석촌역", "송파나루역", "한성백제역",
				"올림픽공원역", "둔촌오륜역", "중앙보훈병원역");
		// 인천 연장
		SubwayManager.registerSection("개화역", "김포공항역", "공항시장역", "신방화역", "마곡나루역", "양천향교역", "가양역", "증미역", "등촌역", "염창역",
				"신목동역", "선유도역", "당산역", "국회의사당역", "여의도역", "샛강역", "노량진역", "노들역", "흑석역", "동작역", "구반포역", "신반포역", "고속터미널역",
				"사평역", "신논현역", "언주역", "선정릉역", "삼성중앙역", "봉은사역", "종합운동장역", "삼전역", "석촌고분역", "석촌역", "송파나루역", "한성백제역",
				"올림픽공원역", "둔촌오륜역", "중앙보훈병원역", "까치울역", "부천종합운동장역", "춘의역", "신중동역", "부천시청역", "상동역", "삼산체육관역", "굴포천역",
				"부평구청역", "산곡역", "석남역");
	}

	public static void main(String[] args) {
		SwingUtilities.invokeLater(() -> new subwayApp2().setVisible(true));
	}
}
